来源 知乎 https://zhuanlan.zhihu.com/p/94096219

1. 导入 Pandas 库并简写为 pd，并输出版本号

In [1]:
import pandas as pd
pd.__version__

'1.3.3'

2. 从列表创建 Series

In [3]:
arr = [1,2,3,4,5]
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

3. 从字典创建 Series

In [5]:
dic = {"test":1, "my":2, "dict":3}
pd.Series(dic)

test    1
my      2
dict    3
dtype: int64

4. 从 NumPy 数组创建 DataFrame

In [11]:
import numpy as np
x = np.random.random((10, 10))
cols = ['A','B','C','D','E','F','G','H','I','J']
pd.DataFrame(x, columns = cols)

,A,B,C,D,E,F,G,H,I,J
0,0.281161,0.747235,0.558948,0.906292,0.163546,0.297457,0.109232,0.349366,0.570573,0.640509
1,0.540470,0.487932,0.629038,0.884939,0.035162,0.018542,0.263452,0.540806,0.775682,0.816350
2,0.638478,0.197675,0.813332,0.170881,0.855097,0.919094,0.206385,0.228838,0.779851,0.196676
3,0.162955,0.492027,0.446552,0.147791,0.943227,0.569267,0.751830,0.461563,0.789294,0.177877
4,0.009247,0.589277,0.504731,0.288256,0.110126,0.491817,0.406742,0.485477,0.976652,0.635823
5,0.123756,0.050266,0.881136,0.470345,0.775318,0.179065,0.416503,0.353974,0.603772,0.913536
6,0.907387,0.877815,0.757889,0.048919,0.384825,0.537930,0.208996,0.834612,0.258511,0.918474
7,0.826275,0.910256,0.017860,0.904234,0.797828,0.281240,0.669727,0.793437,0.816343,0.234146
8,0.823299,0.975160,0.320717,0.293605,0.044262,0.587211,0.761118,0.049206,0.800509,0.532639
9,0.706421,0.326522,0.868472,0.643030,0.458938,0.661566,0.552442,0.576148,0.108627,0.867509

In [9]:
dates = pd.date_range('today',periods=6) # 定义时间序列作为 index
num_arr = np.random.randn(6,4) # 传入 numpy 随机数组
columns = ['A','B','C','D'] # 将列表作为列名
df = pd.DataFrame(num_arr, index = dates, columns = columns)
df

                                   A         B         C         D
2022-01-27 10:19:18.373265 -0.781017  2.336519  0.877032 -0.678802
2022-01-28 10:19:18.373265 -0.851743 -0.015136  1.416701  0.655892
2022-01-29 10:19:18.373265  1.516606  0.071320 -0.630226  0.303261
2022-01-30 10:19:18.373265 -0.332920 -0.494361  0.762228  0.285266
2022-01-31 10:19:18.373265 -1.339592  1.245253 -0.855988 -1.476289
2022-02-01 10:19:18.373265  0.894618  0.241304  1.223114  1.478018

5. 从CSV中创建 DataFrame，分隔符为“；”，编码格式为gbk

In [14]:
df = pd.read_csv('test.csv', encoding='gbk', sep=';')

In [15]:
df

Empty DataFrame
Columns: [hello, my, friend]
Index: []

6. 从字典对象创建DataFrame，并设置索引

In [69]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

8. 展示df的前3行

In [19]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

9. 取出df的animal和age列

In [28]:
df[['animal', 'age']]
# or
df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

10. 取出索引为[3, 4, 8]行的animal和age列

In [31]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

11. 取出age值大于3的行

In [34]:
df[df['age'] > 3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

12. 取出age值缺失的行

In [36]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

13.取出age在2,4间的行（不含）

In [48]:
df[(df['age']>2) & (df['age']<4)]
# 方法二
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

14. `f行的age改为1.5

In [49]:
df.loc['f', 'age'] = 1.5

In [50]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

15. 计算visits的总和

In [52]:
df['visits'].sum()

19

16. 计算每个不同种类animal的age的平均数

In [54]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

17. 计算df中每个种类animal的数量

In [59]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [60]:
df.groupby('animal')['animal'].count()

animal
cat      4
dog      4
snake    2
Name: animal, dtype: int64

18. 先按age降序排列，后按visits升序排列

In [61]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

19. 将priority列中的yes, no替换为布尔值True, False

In [62]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

20. 将animal列中的snake替换为python

In [70]:
df['animal'][df['animal'] == 'snake'] = 'python'
df

C:\Users\rina\AppData\Local\Temp/ipykernel_12592/2987204131.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['animal'][df['animal'] == 'snake'] = 'python'

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

In [71]:
# or
df['animal'] = df['animal'].replace('snake', 'python')
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

21. 对每种animal的每种不同数量visits，计算平均age，即，返回一个表格，行是aniaml种类，列是visits数量，表格值是行动物种类列访客数量的平均年龄 【mark我不会】

In [72]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

22. 在df中插入新行k，然后删除该行

In [86]:
df.loc['k'] = [5.5, 'dog', 'no', 2]
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat  3.0      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog  5.0      2       no
f     cat  2.0      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog  7.0      2       no
j     dog  3.0      1       no
k     5.5  dog     no        2

In [87]:
# 不复制等于没删除
df.drop('k')

   animal  age visits priority
a     cat  2.5      1      yes
b     cat  3.0      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog  5.0      2       no
f     cat  2.0      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog  7.0      2       no
j     dog  3.0      1       no

In [88]:
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat  3.0      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog  5.0      2       no
f     cat  2.0      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog  7.0      2       no
j     dog  3.0      1       no
k     5.5  dog     no        2

In [89]:
df.drop('k', inplace = True)
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat  3.0      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog  5.0      2       no
f     cat  2.0      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog  7.0      2       no
j     dog  3.0      1       no

23. 有一列整数列A的DatraFrame，删除数值重复的行

In [91]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
print(df)
df1 = df.loc[df['A'].shift() != df['A']]
# 方法二
# df1 = df.drop_duplicates(subset='A')
print(df1)

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7
   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

24. 一个全数值DatraFrame，每个数字减去该行的平均数

In [92]:
df = pd.DataFrame(np.random.random((5, 3)))
print(df)
df1 = df.sub(df.mean(axis=1), axis=0)
print(df1)

          0         1         2
0  0.984189  0.012684  0.841429
1  0.448862  0.564022  0.993710
2  0.686458  0.316185  0.572480
3  0.090779  0.603031  0.669611
4  0.679292  0.144865  0.304121
          0         1         2
0  0.371421 -0.600083  0.228662
1 -0.220003 -0.104843  0.324846
2  0.161417 -0.208856  0.047439
3 -0.363695  0.148558  0.215137
4  0.303199 -0.231227 -0.071972

25. 一个有5列的DataFrame，求哪一列的和最小

In [93]:
df = pd.DataFrame(np.random.random((5, 5)), columns=list('abcde'))
df.sum().min(axis = 0)

1.9248850892941316

In [98]:
df.sum().idxmin()

'a'

26. 给定DataFrame，求A列每个值的前3大的B的值的和

In [99]:
df = pd.DataFrame({'A': list('aaabbcaabcccbbc'), 
                   'B': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df)
df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)
print(df1)

    A    B
0   a   12
1   a  345
2   a    3
3   b    1
4   b   45
5   c   14
6   a    4
7   a   52
8   b   54
9   c   23
10  c  235
11  c   21
12  b   57
13  b    3
14  c   87
A
a    409
b    156
c    345
Name: B, dtype: int64

C:\Users\rina\AppData\Local\Temp/ipykernel_12592/3605881006.py:4: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)

27. 给定DataFrame，有列A, B，A的值在1-100（含），对A列每10步长，求对应的B的和

In [138]:
df = pd.DataFrame({'A': [1,2,11,11,33,34,35,40,79,99], 
                   'B': [1,2,11,11,33,34,35,40,79,99]})
print(df)
tmp = pd.cut(df['A'], np.arange(0, 101, 10))
print(tmp)
df1 = df.groupby(tmp)['B'].sum()
print(df1)

    A   B
0   1   1
1   2   2
2  11  11
3  11  11
4  33  33
5  34  34
6  35  35
7  40  40
8  79  79
9  99  99
0      (0, 10]
1      (0, 10]
2     (10, 20]
3     (10, 20]
4     (30, 40]
5     (30, 40]
6     (30, 40]
7     (30, 40]
8     (70, 80]
9    (90, 100]
Name: A, dtype: category
Categories (10, interval[int64, right]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] ... (60, 70] < (70, 80] < (80, 90] < (90, 100]]
A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

28. 给定DataFrame，计算每个元素至左边最近的0（或者至开头）的距离，生成新列y

In [148]:
# cumsum。累加和，就是这个点和他前面所有数字的和
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
x = (df['X'] != 0).cumsum()
print(x)
# 筛选出0的行
y = x != x.shift()
print(y)
df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()

0    1
1    2
2    2
3    3
4    4
5    5
6    6
7    6
8    7
9    8
Name: X, dtype: int32
0     True
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8     True
9     True
Name: X, dtype: bool

29. 一个全数值的DataFrame，返回最大3个值的坐标

In [154]:
df = pd.DataFrame(np.random.random((5, 3)))
print(df)
# unstack会产生旋转，让所有的数值再一列上
print(df.unstack())
df.unstack().sort_values()[-3:].index.tolist()

          0         1         2
0  0.754883  0.426518  0.966502
1  0.202329  0.818142  0.528230
2  0.518900  0.996334  0.684983
3  0.391261  0.135590  0.894286
4  0.264758  0.821824  0.739224
0  0    0.754883
   1    0.202329
   2    0.518900
   3    0.391261
   4    0.264758
1  0    0.426518
   1    0.818142
   2    0.996334
   3    0.135590
   4    0.821824
2  0    0.966502
   1    0.528230
   2    0.684983
   3    0.894286
   4    0.739224
dtype: float64

[(2, 3), (2, 0), (1, 2)]

30. 给定DataFrame，将负值代替为同组的平均值

In [177]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [-12,345,3,1,45,14,4,-52,54,23,-235,21,57,3,87]})
print(df)

def replace(group):
    mask = group < 0
    group[mask] = group[~mask].mean()
    return group

df['vals'] = df.groupby(['grps'])['vals'].apply(replace)
print(df)

   grps  vals
0     a   -12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a   -52
8     b    54
9     c    23
10    c  -235
11    c    21
12    b    57
13    b     3
14    c    87
   grps        vals
0     a  117.333333
1     a  345.000000
2     a    3.000000
3     b    1.000000
4     b   45.000000
5     c   14.000000
6     a    4.000000
7     a  117.333333
8     b   54.000000
9     c   23.000000
10    c   36.250000
11    c   21.000000
12    b   57.000000
13    b    3.000000
14    c   87.000000

31. 计算3位滑动窗口的平均值，忽略NAN

【rolling 移动窗口 https://blog.csdn.net/qifeidemumu/article/details/88748248 】
【答案这里按组了】

In [183]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                    'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
print(df)

g1 = df.groupby(['group'])['value']
# nan填充
g2 = df.fillna(0).groupby(['group'])['value'] 

# 每三个求和 / 长度为三的窗口里的数字
s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count()
print(s)
# 按顺序重新排列下idx
s.reset_index(level=0, drop=True).sort_index()

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
group
a      0     1.000000
       1     1.500000
       4     1.666667
       8     3.666667
       10    4.500000
b      2     3.000000
       3     3.000000
       5     3.000000
       6     3.000000
       7     2.000000
       9     2.000000
       11    4.000000
Name: value, dtype: float64

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

32. 创建Series s，将2015所有工作日作为随机值的索引

In [184]:
dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)

s.head(10)

2015-01-01    0.218370
2015-01-02    0.838016
2015-01-05    0.565516
2015-01-06    0.065506
2015-01-07    0.718658
2015-01-08    0.180233
2015-01-09    0.796911
2015-01-12    0.080371
2015-01-13    0.805538
2015-01-14    0.889069
Freq: B, dtype: float64

33. 所有礼拜三的值求和

In [185]:
s[s.index.weekday == 2].sum()

25.993867353232304

34. 求每个自然月的平均数

In [186]:
s.resample('M').mean()

2015-01-31    0.475569
2015-02-28    0.491480
2015-03-31    0.488408
2015-04-30    0.507546
2015-05-31    0.511758
2015-06-30    0.349750
2015-07-31    0.351269
2015-08-31    0.416304
2015-09-30    0.530198
2015-10-31    0.365963
2015-11-30    0.537069
2015-12-31    0.521339
Freq: M, dtype: float64

35. 每连续4个月为一组，求最大值所在的日期

In [187]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-15
2015-05-31   2015-04-03
2015-09-30   2015-09-17
2016-01-31   2015-10-14
Freq: 4M, dtype: datetime64[ns]

36. 创建2015-2016每月第三个星期四的序列

In [188]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

### 数据清洗

In [214]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

37. FlightNumber列中有些值缺失了，他们本来应该是每一行增加10，填充缺失的数值，并且令数据类型为整数

In [215]:
# 用 Interpolate直接做插值
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

38. 将From_To列从_分开，分成From, To两列，并删除原始列

In [216]:
# 没有expand会变成列表
tmp = df['From_To'].str.split("_", expand=True)
print(tmp)
tmp.columns = ['From', 'To']
df = df.join(tmp)
df.drop('From_To', axis = 1, inplace = True)

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [217]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

39. 将From, To大小写统一首字母大写其余小写

In [218]:
df['From'] = df['From'].str.capitalize()
df['To'] = df['To'].str.capitalize()
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

40. Airline列，有一些多余的标点符号，需要提取出正确的航司名称。举例：'(British Airways. )' 应该改为 'British Airways'.

In [219]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

41. Airline列，数据被以列表的形式录入，但是我们希望每个数字被录入成单独一列，delay_1, delay_2, ...没有的用NAN替代。

In [220]:
# 每一行都变成pd.Series
delays = df['RecentDelays'].apply(pd.Series)
print(delays)
# 重命名
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)
df

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

### 层次化索引

42. 用 letters = ['A', 'B', 'C']和 numbers = list(range(10))的组合作为系列随机值的层次化索引

【层次化索引是pandas的一项重要功能，它能使你在一个轴上有多个索引级别，也就是说，它能使你以低维度形式处理高维度数据】

In [221]:
letters = ['A', 'B', 'C']
numbers = list(range(4))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(12), index=mi)
s

A  0    0.838976
   1    0.747085
   2    0.947999
   3    0.653863
B  0    0.061181
   1    0.602201
   2    0.067105
   3    0.818981
C  0    0.573411
   1    0.248492
   2    0.142801
   3    0.877992
dtype: float64

43. 检查s是否是字典顺序排序的

In [222]:
s.index.is_lexsorted()
# 方法二
# s.index.lexsort_depth == s.index.nlevels

C:\Users\rina\AppData\Local\Temp/ipykernel_12592/1287029911.py:1: FutureWarning: MultiIndex.is_lexsorted is deprecated as a public function, users should use MultiIndex.is_monotonic_increasing instead.
  s.index.is_lexsorted()

True

44. 选择二级索引为1, 3的行

In [223]:
s.loc[:, [1, 3]]

A  1    0.747085
   3    0.653863
B  1    0.602201
   3    0.818981
C  1    0.248492
   3    0.877992
dtype: float64

45. 对s进行切片操作，取一级索引至B，二级索引从2开始到最后

In [224]:
s.loc[pd.IndexSlice[:'B', 2:]]
# 方法二
# s.loc[slice(None, 'B'), slice(2, None)]

A  2    0.947999
   3    0.653863
B  2    0.067105
   3    0.818981
dtype: float64

46. 计算每个一级索引的和（A, B, C每一个的和）

In [225]:
s.sum(level=0)

C:\Users\rina\AppData\Local\Temp/ipykernel_12592/1970297740.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  s.sum(level=0)

A    3.187922
B    1.549468
C    1.842695
dtype: float64

47. 交换索引等级，新的Series是字典顺序吗？不是的话请排序

In [226]:
new_s = s.swaplevel(0, 1)
print(new_s)
print(new_s.index.is_lexsorted())
new_s = new_s.sort_index()
print(new_s)

0  A    0.838976
1  A    0.747085
2  A    0.947999
3  A    0.653863
0  B    0.061181
1  B    0.602201
2  B    0.067105
3  B    0.818981
0  C    0.573411
1  C    0.248492
2  C    0.142801
3  C    0.877992
dtype: float64
False
0  A    0.838976
   B    0.061181
   C    0.573411
1  A    0.747085
   B    0.602201
   C    0.248492
2  A    0.947999
   B    0.067105
   C    0.142801
3  A    0.653863
   B    0.818981
   C    0.877992
dtype: float64

C:\Users\rina\AppData\Local\Temp/ipykernel_12592/265693915.py:3: FutureWarning: MultiIndex.is_lexsorted is deprecated as a public function, users should use MultiIndex.is_monotonic_increasing instead.
  print(new_s.index.is_lexsorted())